//=============================================================================
//
// ギミックの基盤処理 [gimmick.h]
// Author : saito shian
//
//=============================================================================
#ifndef _GIMMICK_H_
#define _GIMMICK_H_

//=============================================================================
// インクルードファイル
//=============================================================================
#include "objectX.h"

//=============================================================================
// 前方定義
//=============================================================================

//=============================================================================
// クラスの定義
//=============================================================================
class CGimmick : public CObjectX
{
public:
	//-------------------------------------------------------------------------
	// タイプ
	//-------------------------------------------------------------------------
	enum GIMMICKTYPE
	{
		GIMMICKTYPE_NONE = 0,
		GIMMICKTYPE_MOVEWALL,		// 動く壁
		GIMMICKTYPE_MAX
	};
	//-------------------------------------------------------------------------
	// コンストラクタとデストラクタ
	//-------------------------------------------------------------------------
	explicit CGimmick(int nPriority = PRIORITY_LEVEL3);
	~CGimmick() override;

	//-------------------------------------------------------------------------
	// メンバー関数
	//-------------------------------------------------------------------------
	HRESULT Init() override;			// 初期化処理
	void Uninit() override;				// 終了処理
	void Update() override;				// 更新処理
	void Draw() override;				// 描画処理

	GIMMICKTYPE GetGimmickType(void) { return m_GimmickType; }	// ギミックの種類の取得
	void SetGimmickType(GIMMICKTYPE type);						// ギミックの種類の設定

	virtual void ConstOperate(int barrage,int rotate) = 0;		// 一定の操作(連打、回転)

	bool GetCompletion() { return m_Completion; }				// 完了したかを知らせる

private:
	//-------------------------------------------------------------------------
	// メンバー変数
	//-------------------------------------------------------------------------
	D3DXVECTOR3 m_Pos;				// ギミックの位置
	D3DXVECTOR3 m_Area;				// ギミックの範囲
	GIMMICKTYPE m_GimmickType;		// ギミックの種類
	static bool m_Completion;		// 完了したか否かフラグ
};
#endif
