//=============================================================================
//
// メイン処理 [main.h]
// Author : KADO TAKUMA
//
//=============================================================================
#ifndef _MAIN_H_
#define _MAIN_H_

//*****************************************************************************
// ライブラリーリンク
//*****************************************************************************
#pragma comment(lib,"d3d9.lib")
#pragma comment(lib,"d3dx9.lib")
#pragma comment(lib,"winmm.lib")
#pragma comment(lib,"dxguid.lib")        //DirectXコンポーネント（部品）使用に必要
#pragma comment(lib,"dinput8.lib")       //入力処理に必要
#pragma comment(lib,"xinput.lib")        //入力処理に必要

//*****************************************************************************
// インクルード
//*****************************************************************************
#define DIRECTINPUT_VERSION (0x0800)		//ビルド時の警告対処用マクロ
#include <stdio.h>
#include <Windows.h>
#include <tchar.h> // _T
#include <d3dx9.h>
#include <dinput.h>
#include <xinput.h>
#include <assert.h>
#include <time.h>

//=============================================================================
// マクロ定義
//=============================================================================
#define SCREEN_SPLIT_WIDTH	(200.0f)		//分割画面の幅
#define SCREEN_SPLIT_HEIGHT	(740.0f)		//分割画面の高さ

//*****************************************************************************
// 定数定義
//*****************************************************************************
namespace
{
	// ウインドウのクラス名
	LPCTSTR CLASS_NAME = _T("AppClass");
	// ウインドウのキャプション名
	LPCTSTR WINDOW_NAME = _T("NEON PARTY");
}

// スクリーンの幅
const int SCREEN_WIDTH = 1280;
// スクリーンの幅の真ん中
const float SCREEN_WIDTH_HALF = 640.0f;
// スクリーンの高さ
const int SCREEN_HEIGHT = 720;
// スクリーンの高さの真ん中
const float SCREEN_HEIGHT_HALF = 360.0f;

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CRenderer;
class CObject;

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
int GetFPS(void);

#endif