//=============================================================================
//
// 押すと動く壁ギミック
// Author : saito shian
// Author : Yuda Kaito
//
//=============================================================================
#ifndef _PUSH_MOVE_WALL_H_
#define _PUSH_MOVE_WALL_H_

//=============================================================================
// インクルードファイル
//=============================================================================
#include "gimmick.h"

//=============================================================================
// クラスの定義
//=============================================================================
class CPushMoveWall : public CGimmick
{
public:
	//-------------------------------------------------------------------------
	// コンストラクタとデストラクタ
	//-------------------------------------------------------------------------
	explicit CPushMoveWall(int nPriority = PRIORITY_LEVEL3);
	~CPushMoveWall() override;

	// 生成処理
	static CPushMoveWall *Create(const D3DXVECTOR3& pos);

	//-------------------------------------------------------------------------
	// メンバー関数
	//-------------------------------------------------------------------------
	HRESULT Init() override;		// 初期化処理
	void Uninit() override;			// 終了処理
	void Update() override;			// 更新処理
	void Draw() override;			// 描画処理

	void ConstOperate() override;	// 一定の操作(連打、回転)

private:
	//-------------------------------------------------------------------------
	// メンバー変数
	//-------------------------------------------------------------------------
	D3DXVECTOR3 m_PosOld;			// 前回の位置
	int m_nTriggerCount;			// キーを押した回数

	bool m_Completion;				// Gimmickが完了したか否かフラグ
};
#endif
