//=============================================================================
//
// ランダムドア
// Author : saito shian
//
//=============================================================================
#ifndef _RANDOM_DOOR_H_
#define _RANDOM_DOOR_H_

//=============================================================================
// インクルードファイル
//=============================================================================
#include "gimmick.h"

//=============================================================================
// クラスの定義
//=============================================================================
class CRandomDoor : public CGimmick
{
public:
	//-------------------------------------------------------------------------
	// コンストラクタとデストラクタ
	//-------------------------------------------------------------------------
	explicit CRandomDoor(int nPriority = PRIORITY_LEVEL3);
	~CRandomDoor() override;

	// 生成処理
	static CRandomDoor *Create(const D3DXVECTOR3& pos);

	//-------------------------------------------------------------------------
	// メンバー関数
	//-------------------------------------------------------------------------
	HRESULT Init() override;		// 初期化処理
	void Uninit() override;			// 終了処理
	void Update() override;			// 更新処理
	void Draw() override;			// 描画処理

	void ConstOperate() override;	// 一定の操作(連打、回転)

private:
	//-------------------------------------------------------------------------
	// メンバー変数
	//-------------------------------------------------------------------------
	int m_RandNumber;				// ランダムの数字
	int m_DoorNumber;				// ドアの番号
	bool m_RandFlag;				// ドアの番号とランダムの番号が一致したかフラグ
	bool m_RandNumberFlag;			// ランダムで番号を決めたかのフラグ
};
#endif

