//=============================================================================
//
// タイトルメニュー処理 [title_menu.h]
// Author : KADO TAKUMA
//
//=============================================================================
#ifndef _TITLE_MENU_H_ 
#define _TITLE_MENU_H_

//=============================================================================
// インクルードファイル
//=============================================================================
#include "main.h"
#include "mode.h"
#include "object2D.h"
#include "application.h"

//=============================================================================
// 前方宣言
//=============================================================================
class CObject2D;

//=============================================================================
// クラスの定義
//=============================================================================
class CTitleMenu : public CObject2D
{
public:
	//-------------------------------------------------------------------------
	// コンストラクタとデストラクタ
	//-------------------------------------------------------------------------
	explicit CTitleMenu(int nPriority = PRIORITY_LEVEL4);
	~CTitleMenu();

	//-------------------------------------------------------------------------
	// メンバー関数
	//-------------------------------------------------------------------------
	HRESULT Init() override;				// 初期化処理
	void Uninit() override;					// 終了処理
	void Update() override;					// 更新処理
	void Draw() override;					// 描画処理
	static CTitleMenu *Create(void);		// 生成処理

private:
	//-------------------------------------------------------------------------
	// メンバー変数
	//-------------------------------------------------------------------------
	static	CObject2D *m_apObject2D[4];		// ポインタ
	int		m_nTextureMax;					// 使用するテクスチャの最大数
	bool	m_bGame;						// GAMEフラグ
	bool	m_bTutorial;					// TUTORIALフラグ
	bool	m_bRanking;						// RANKINGフラグ
};
#endif