//=============================================================================
//
// タイトル処理 [title.h]
// Author : KADO TAKUMA
//
//=============================================================================
#ifndef _TITLE_H_
#define _TITLE_H_

//=============================================================================
// インクルードファイル
//=============================================================================
#include "main.h"
#include "object2D.h"
#include "mode.h"

//=============================================================================
// 前方定義
//=============================================================================
class CFade;
class CMeshfield;
class CLight;

//=============================================================================
// クラスの定義
//=============================================================================
class CTitle : public CMode
{
public:
	//-------------------------------------------------------------------------
	// コンストラクタとデストラクタ
	//-------------------------------------------------------------------------
	CTitle();
	~CTitle() override;

	//-------------------------------------------------------------------------
	// メンバー関数
	//-------------------------------------------------------------------------
	HRESULT Init(void) override;	// 初期化処理
	void Uninit(void) override;		// 終了処理
	void Update(void) override;		// 更新処理
	void Draw(void) override;		// 描画処理
	static CTitle *Create();		// 生成処理

private:
	//-------------------------------------------------------------------------
	// メンバー変数
	//-------------------------------------------------------------------------
	static LPDIRECT3DTEXTURE9 m_pTexture;	// テクスチャのポインタ
	static bool m_bTitleEnter;				// Enterを押したかのフラグ
	CObject2D *m_pObject2D;					// オブジェクト2Dのポインタ
	CFade *m_pFade;							// フェードのポインタ
	CMeshfield *m_pMeshField;				// メッシュフィールドのポインタ
	CLight *m_pLight;						// ライトのポインタ
};

#endif